; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty ?x - robot)
        (handfull ?x - robot)
        (holding ?x - block)
    )
    (:action pick-up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put-down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld2)
    (:domain blocksworld)
    (:objects
        blue_block - block
        pink_block - block
        red_block - block
        yellow_block - block
        orange_block - block
        green_block - block
        robot - robot
    )
    (:init
        (ontable blue_block)
        (ontable pink_block)
        (ontable red_block)
        (ontable yellow_block)
        (ontable orange_block)
        (ontable green_block)
        (handempty robot)
        (clear blue_block)
        (clear pink_block)
        (clear red_block)
        (clear yellow_block)
        (clear orange_block)
        (clear green_block)
    )
    (:goal (and 
        (on blue_block pink_block)
        (on pink_block red_block)
        (on yellow_block orange_block)
        (on orange_block green_block)
    ))
)

; plan
1. (pick-up pink_block robot)
   deleted: (ontable pink_block) (clear pink_block) (handempty robot)
   added: (handfull robot) (holding pink_block)
   goals met: 0 of 4
2. (stack pink_block red_block robot)
   deleted: (holding pink_block) (clear red_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (on pink_block red_block)
   goals met: 1 of 4
3. (pick-up blue_block robot)
   deleted: (ontable blue_block) (clear blue_block) (handempty robot)
   added: (handfull robot) (holding blue_block)
   goals met: 1 of 4
4. (stack blue_block pink_block robot)
   deleted: (holding blue_block) (clear pink_block) (handfull robot)
   added: (clear blue_block) (handempty robot) (on blue_block pink_block)
   goals met: 2 of 4
5. (pick-up orange_block robot)
   deleted: (ontable orange_block) (clear orange_block) (handempty robot)
   added: (handfull robot) (holding orange_block)
   goals met: 2 of 4
6. (stack orange_block green_block robot)
   deleted: (holding orange_block) (clear green_block) (handfull robot)
   added: (clear orange_block) (handempty robot) (on orange_block green_block)
   goals met: 3 of 4
7. (pick-up yellow_block robot)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty robot)
   added: (handfull robot) (holding yellow_block)
   goals met: 3 of 4
8. (stack yellow_block orange_block robot)
   deleted: (holding yellow_block) (clear orange_block) (handfull robot)
   added: (clear yellow_block) (handempty robot) (on yellow_block orange_block)
   goals met: 4 of 4
